## Merge, Join ve Concatenate

In [1]:
import numpy as np
import pandas as pd

### Concatenation

In [2]:
dataset1 = {
    "A": ["A1","A2","A3","A4"],
    "B":["B1","B2","B3","B4"],
    "C":["C1","C2","C3","C4"],
}

In [3]:
dataset2 = {
    "A": ["A5","A6","A7","A8"],
    "B":["B5","B6","B7","B8"],
    "D":["C5","C6","C7","C8"],
}

In [4]:
df1 = pd.DataFrame(dataset1,index = [1,2,3,4])
df2 = pd.DataFrame(dataset2,index = [5,6,7,8] )

In [5]:
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [6]:
df2

    A   B   D
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [8]:
pd.concat([df2,df1])

    A   B    D    C
5  A5  B5   C5  NaN
6  A6  B6   C6  NaN
7  A7  B7   C7  NaN
8  A8  B8   C8  NaN
1  A1  B1  NaN   C1
2  A2  B2  NaN   C2
3  A3  B3  NaN   C3
4  A4  B4  NaN   C4

In [10]:
pd.concat([df1,df2],axis = 1)

     A    B    C    A    B    D
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN   A8   B8   C8

### Merge

In [16]:
dataset1 = {
    "A" : ["A1","A2","A3"],
    "B" : ["B1","B2","B3"],
    "anahtar" : ["K0","K5","K3"]
}

In [17]:
df1 = pd.DataFrame(dataset1,index = [1,2,3])

In [18]:
df1

    A   B anahtar
1  A1  B1      K0
2  A2  B2      K5
3  A3  B3      K3

In [19]:
dataset2 = {
    "X" : ["X1","X2","X3","X4"],
    "Y" : ["Y1","Y2","Y3","Y4"],
    "anahtar" : ["K0","K2","K5","K4"]
}

In [20]:
df2 = pd.DataFrame(dataset2,index = [1,2,3,4])

In [21]:
df2

    X   Y anahtar
1  X1  Y1      K0
2  X2  Y2      K2
3  X3  Y3      K5
4  X4  Y4      K4

on parametresi hangi sütun üzerinden iki DataFrame'in bağlanacağını belirtmektedir.
how parametresinde outer,inner,left,right olarak bağlantı yapılacağının belirtir. 
outer: Tüm değerleri alır, olmayan değerler için NaN yazılır.
inner: İki tarafta olmayan değerler yok sayılır.
left:  Sol tarafta yazılan değerleri alır.
right: Sağ tarafta yazılan değerleri alır.

In [25]:
pd.merge(df1,df2,how ="right",on = "anahtar")

     A    B anahtar   X   Y
0   A1   B1      K0  X1  Y1
1  NaN  NaN      K2  X2  Y2
2   A2   B2      K5  X3  Y3
3  NaN  NaN      K4  X4  Y4

### Join

In [26]:
dataset1 = {
    "A" : ["A1","A2","A3","A4"],
    "B" : ["B1","B2","B3","A4"],
}
dataset2 = {
    "X" : ["X1","X2","X3"],
    "Y" : ["Y1","Y2","Y3"],
    
}

In [27]:
df1 = pd.DataFrame(dataset1,index = [1,2,3,4]) 
df2 = pd.DataFrame(dataset2,index = [1,2,3])

In [28]:
df1

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  A4

In [29]:
df2

    X   Y
1  X1  Y1
2  X2  Y2
3  X3  Y3

In [30]:
df2.join(df1)

    X   Y   A   B
1  X1  Y1  A1  B1
2  X2  Y2  A2  B2
3  X3  Y3  A3  B3

In [31]:
df1.join(df2)

    A   B    X    Y
1  A1  B1   X1   Y1
2  A2  B2   X2   Y2
3  A3  B3   X3   Y3
4  A4  A4  NaN  NaN